# PhyMaterialProperties Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialProperties Property
ParameterTypeId Class See Also
---
"Properties"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialProperties { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialProperties As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialProperties {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace